src/Documents/КАЗ_СогласованиеЗаявки/КАЗ_СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_СогласованиеЗаявки</name>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>EnumRef.КАЗ_РешенияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/КАЗ_ИсторияСогласования/КАЗ_ИсторияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КАЗ_ИсторияСогласования</name>
  <periodicity>Day</periodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>EnumRef.КАЗ_РешенияСогласования</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/КАЗ_СогласованиеЗаявки/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Согласующий) Тогда
		Объект.Согласующий = ТекущийПользовательКаталогаНаСервере();
	КонецЕсли;

	Объект.НомерЭтапа = СледующийНомерЭтапаНаСервере(Объект.Заявка);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийПользовательКаталогаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Пользователи.ПустаяСсылка();

КонецФункции

&НаСервереБезКонтекста
Функция СледующийНомерЭтапаНаСервере(Заявка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(История.НомерЭтапа) КАК МаксНомерЭтапа
	|ИЗ
	|	РегистрСведений.КАЗ_ИсторияСогласования КАК История
	|ГДЕ
	|	История.Заявка = &Заявка";

	Запрос.УстановитьПараметр("Заявка", Заявка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.МаксНомерЭтапа) Тогда
		Возврат Выборка.МаксНомерЭтапа + 1;
	КонецЕсли;

	Возврат 1;

КонецФункции
